Revit 2027 API
BuiltInFailures.StairRampFailures.PartOfRiserLiesOnBoundaryFailure Property
 Part of the riser lies on the boundary is not allowed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId PartOfRiserLiesOnBoundaryFailure { get; }
Public Shared ReadOnly Property PartOfRiserLiesOnBoundaryFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ PartOfRiserLiesOnBoundaryFailure {
	FailureDefinitionId^ get ();
}
static member PartOfRiserLiesOnBoundaryFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace